{
  "basic_info": {
    "description_header": "I'm Ricardo Felisbino. ",
    "description": "Software developer, always looking to update myself using the best practices in the market. Proactive, creative, always looking for efficient and innovative ways to solve problems.\nDomain of agile methodology in project management with Scrum, Kanban, Feature Driven Development (FDD) and eXtreme Programming (XP). Currently focusing on Java 8 and 11+ on microservices using Spring Framework, and also Javascript applications using ReactJS.\nI have 14 years of experience in the technology field, with the last 9 years focused on software development. And I've been specializing in project management, clean code and agile development practices.",
    "section_name": {
      "about": "About me",
      "projects": "How to be a good developer?",
      "skills": "Skills",
      "experience": "Experience"
    }
  },
  "projects": [
    {
      "title": "Tip 1: It's always time to learn",
      "description": "- Seek to constantly learn innovative content in different modalities of the programming area: as a tool, a language, a technique, among others.\n- Those who seek knowledge can develop constant stimuli in their brain, where this becomes more active, not being accommodated, improving your skills in the area of programming.\n- Read good books in this area.\n- Seek to watch enriching series, based on the subject of programming.\n- Talk to other developers, whether on your work, in courses, lectures, among other environments. Where such action will help you see the world of programming from other perspectives.",
      "image": "images/portfolio/dev/dica1.png"
    },
    {
      "title": "Tip 2: Find your focus",
      "description": "- The requirements in the programming area vary according to the type of software or application.\n- Research the areas and the way each one develops and performs their projects.\n- Look for the focus of his performance, with which he identifies and which he can develop his skills.\n- The performance of a software developer can cover several areas, among them: Front-end, Back-end, Full-stack.",
      "image": "images/portfolio/dev/dica2.png"
    },
    {
      "title": "Tip 3: Think",
      "description": "- Analyze and think about how you will carry out your task, and what the expected results will be with your action.\n- Always plan. Create a checklist, verify and perform tests. In order to deliver the task complete and without bugs .",
      "image": "images/portfolio/dev/dica3.png"
    },
    {
      "title": "Tip 4: Simplify your code",
      "description": "- The best developers write simple and straightforward code that other developers can read and understand.\n- Use names for your methods according to what they purport to do.",
      "image": "images/portfolio/dev/dica4.png"
    },
    {
      "title": "Tip 5: Share knowledge",
      "description": "- Whenever you can share your knowledge with your coworker, in addition to helping, you can be a reference for your programming team.\n- Being selfish is not a good practice, because you will be self sabotaging yourself. By interacting with the other, you not only transmit knowledge, but you can also learn from those who shared it. This way it will be enriching for both of you and the team.",
      "image": "images/portfolio/dev/dica5.png"
    },
    {
      "title": "Tip 6: Ask for Help",
      "description": "- If you are unable to solve a certain problem and have already checked the most varied ways, do not be ashamed or afraid to tell your co-worker that you are not succeeding, ask for help, as the other may be able to identify and teach you /help something you haven't mastered in the area yet.\n- But be careful! Try not to call your colleague several times, only really when you have no other alternative, as it could take away the other's concentration, as well as disrupt their productivity." ,
      "image": "images/portfolio/dev/dica6.png"
    }
  ],
  "experience": [
    {
      "icon": "fa-java",
      "company": "Leroy Merlin Brazil",
      "title": "Senior Software Developer",
      "years": "04.2023 - currently",
      "mainTech": [
        "Java"
      ],
      "technologies": [
        "Java",
        "Spring",
        "JavaScript",
        "React",
        "SQL",
        "GCP",
        "AWS"
      ]
    },
    {
      "icon": "fa-java",
      "company": "Koin",
      "title": "Tech Lead Team",
      "years": "01.2023 - 04.2023",
      "mainTech": [
        "Java"
      ],
      "technologies": [
        "Java",
        "Spring",
        "JavaScript",
        "React",
        "SQL",
        "AWS"
      ]
    },
    {
      "icon": "fa-java",
      "company": "Koin",
      "title": "Developer Fullstack",
      "years": "04.2022 - 12.2022",
      "mainTech": [
        "Java"
      ],
      "technologies": [
        "Java",
        "Spring",
        "JavaScript",
        "React",
        "SQL",
        "AWS"
      ]
    },
    {
      "icon": "fa-java",
      "company": "TDSoft",
      "title": "Developer Fullstack",
      "years": "08.2019 - 02.2022",
      "mainTech": [
        "Java"
      ],
      "technologies": [
        "Java",
        "Spring",
        "JavaScript",
        "React",
        "SQL",
        "AWS"
      ]
    },
    {
      "icon": "fa-php",
      "company": "RFSistema.net",
      "title": "Owner and Software Developer",
      "years": "06.2014 - 06.2019",
      "mainTech": [
        "PHP"
      ],
      "technologies": [
        "PHP",
        "Wordpress",
        "JavaScript",
        "Bootstrap",
        "React",
        "SQL",
        "Java",
        "Spring",
        "Laravel"
      ]
    },
    {
      "icon": "fa-php",
      "company": "freelance",
      "title": "Teacher and Software Developer",
      "years": "11.2009 - 06.2014",
      "mainTech": [
        "PHP"
      ],
      "technologies": [
        "PHP",
        "Wordpress",
        "JavaScript",
        "Bootstrap",
        "React",
        "SQL",
        "Java",
        "Spring"
      ]
    }
  ]
}